---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewGeometryOptions
source: html/4c4f2a63-13e5-6e2f-fc35-c0c73a8d9322.htm
---
# Autodesk.Revit.Creation.Application.NewGeometryOptions Method

Creates an object to specify user preferences in parsing of geometry.

## Syntax (C#)
```csharp
public Options NewGeometryOptions()
```